Revit 2026 API

# ExternalResourceUtilsGetAllExternalResourceReferences(Document) Method

---

Gets the ids of all elements which refer to external resources.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static ISet<ElementId> GetAllExternalResourceReferences(
	Document document
)
```
```vb
Public Shared Function GetAllExternalResourceReferences (
	document As Document
) As ISet(Of ElementId)
```
```cpp
public:
static ISet<ElementId^>^ GetAllExternalResourceReferences(
	Document^ document
)
```
```fsharp
static member GetAllExternalResourceReferences :
        document : Document -> ISet<ElementId>
```

#### Parameters

document Document
     The Revit Document containing the external resource references.

#### Return Value

ISetElementId The ids of all elements which refer to external resources.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

This function will not return the ids of nested Revit links; it only returns top-level references.

#### Reference

ExternalResourceUtils Class

GetAllExternalResourceReferences Overload

Autodesk.Revit.DB Namespace